[{"id":1627772400,"title":"Reliably sizing particles in Multi-modal Suspension","author":"Auro","date":"August 01, 2021","content":"<b>Numerous conventional techniques are available to calculate particle size distributions in colloidal suspensions. However, to achieve any reliable statistics, the methods are limited to mono-modal suspensions. A new technique, Differential Dynamic Microscopy(DDM) is explored in search for a reliable method to study multimodal suspension. The experiment considers Bi-modal polystyrene suspension under Laser Diffraction, Scanning Electron microscopy and DDM. The obtained data are compared to understand the limitations of each method.</b>  \n<br>\n\nThe experiment aimed at finding the size distribution of Polystyrene suspension in waterusing three different techniques, namely - Scanning Electron Microscopy, Laser Diffrac-tion Particle analyzer and Direct Differential microscopy.   Then comparing the resultsobtained to judge the reliability of the methods for bi-modal suspensions of known con-centration by weight.\n\n[Read full report here](https://uoe-my.sharepoint.com/:b:/g/personal/s1905547_ed_ac_uk/EcMJeXtDfCRCquqHvlJwWL4BHdUDad8hbpqqhoPjAyC4YA?e=FSGWFe)"},{"id":1614556800,"title":"Simulation of Argon atoms interacting with Lennard Jones Potential at different phases","author":"Auro","date":"March 01, 2021","content":"<b>Abstract:</b>Argon atoms were simulated at different phases where interaction among the atoms was determined\nby Lennard-Jones potential.The trajectory is propagated using Verlocity-Verlet time integrator inside a simulation box adhering to periodic boundary conditions and minimum image convention.\nThe dynamics of the system was compared at three different phases namely solid, liquid and gas\nusing Mean Squared Displacement and Radial Distribution function, which had generic trend for\nthe corresponding phase. The melting point of the Solid Argon simulation was calculated to be\n0.653ε which is within 3 error bar of the literature value from Mastnya and Pablo.\n\n[Read full report here](https://uoe-my.sharepoint.com/:b:/g/personal/s1905547_ed_ac_uk/ERGmTGUvqO9EmOzqerOxryYB1kIHUAX1xb43YyLvCnRR3Q?e=S6HuK4)"}]