[{"id":1646438400,"title":"Up and Coming Musician Phoebe Hall","author":"Moira Semel","date":"March 5, 2022","coverurl":"./assets/images/Phoebes-INterview-min.jpg","content":"Phoebe Hall interviewed by Moira Semel\n\n**How long have you been making music and what got you into releasing music more professionally?**\n\nI’ve been writing since I was about 17. I’d always sung at school but then I started writing when I got more anxious, when I started 6th form. I actually wrote my first song after a panic attack. Which, I think, is quite a good way to deal with it. I’d always wanted to start writing properly and I’d always written little verses but then I actually wrote a full song and I started to really do it  in my year out before I came to uni. The new stuff I’ve been writing, I’ve been working in Manchester for the past few months. I started to release properly this year, really. It’s the big year. \n\n**Your new song ‘Runaway’ is about to come out. How do you feel about it coming out? How does it feel to release a song?**\n\nIt’s a weird one. We had put it out on Soundcloud because I wanted people to know it for the first gig. I thought that would be fun for my friends and family who were there to know the words. With Soundcloud it's a real effort for people to get to it, so it kind of feels like I've been sitting on it for such a long time. It’s like you build up to it for so long that tomorrow is going to be a bit strange. It’s a process you have to start really early. It takes quite a while for all the platforms to get the song. Sort of a weird process. It takes like a month to do it all. So it is quite a lot like building up. I don't want to say underwhelming cause I think that’s the wrong word. It is really exciting and it’s always great when you get messages and you’ve sometimes reached people that you didn’t think you would reach. \n\nThere is always an element of, because I’m not like Adele you know, it’s not going to blow my mind, but it’s always nice to have it out because I am really happy with it. It is a new era of music for me and it's a sign of all the things that are coming. In general, I'm excited is my answer.\n\n**Do you feel your identity is formed by your music or your music by your identity?**\n\nInitially the music was formed by my identity. But I think particularly with the stuff I’ve been writing now in Manchester, I didn’t know the guys I was writing with and you have to just sit down and talk about musical influences and your life and they know more about me than people in my life do now it's like, \n**- an interesting therapy session? -** \nit is! It's weird cause like I'd write a line and they’d be like what do you mean by that and it’s just like oop umm. It all becomes a weird like, like it’s a weird industry where you sit down with people you barely know and tell them everything. So I’d say working with them definitely shapes my music. \n\nI like to be driven by my relationships and I also write a lot about queerness and my identiy and how I dress and androgyny. Those things shape the music and the sound. But I think the music and your identity, they eventually shape each other. You create an image when you’re making music. I’ve got this bedroom pop image and that kind of thing. That’s the music I make and you kind of have to lean into it ‘cause those are the kind of things you write about. \n\n**So this image that you’re making of bedroom pop. We all have these social media platforms where we are judged off of these digital versions of ourselves that are both you and not you. As a musician how do you feel about having to create and uphold social media constructions of yourself?**\n\nIt’s definitely a bit of a mind field. I think with TikTok especially, with releasing stuff now so much of it is pushed by putting TikToks out all the time. You make five TikToks that look the same but you have to put them out to try. It’s really good in some ways because it means that everyone has a platform who might not otherwise have had one but it’s also bad because labels aren’t going to gigs anymore they’re just looking at TikTok and seeing a kid who can sign and signing them. It’s such a strange process. It’s really changed the industry. People are now literally curating songs for TikTok. Which is just so bizarre. \n\n**Do you feel a pressure to do that?**\n\nYeah, I feel like it can be really fun if I make stuff that’s fun and it is really exciting to reach people that you might not have reached normally. It can be global if things go really well. All the work that I’ve done in Manchester is because this guy just reached out from seeing a post and I wouldn’t have gotten that opportunity if I hadn’t done that.  \n\nBut trends go so fast. ‘This week people are talking about the sound’ and ‘this week they’re talking about the lyrics’. Or ‘that was on trend three weeks ago, don’t do that’. It’s about making myself more on top of it. \nI was reading about scrapbook Instagram where people are treating personal accounts like a scrapbook. So it looks like it’s less curated but it’s not. Like really blurry, shit pictures are actually more curated. There is a certain pressure to keep the socials looking good. It is really fun but I’m just learning about it all the time. Keeping your account really cool and having a balance of still having a personal account but also building a professional one. \nIn the new year I wanted to delete TikTok and delete Instagram but I literally can’t. I know it’s like “boohoo get out of my tiny world” but it’s just an interesting situation to be in. \n\n**What does it look like for you to write music and where do you get your inspiration?**\n\nSo if I’m writing on my own it’s usually with a guitar. Start with some chords and go from there. The guy who I gig with, he’s my best mate in uni, I’ll send him something and he’ll play around with it. We write stuff like that quite a lot. Then I’ll usually take that with me for the sessions in Manchester and I’ll do my main writing there. \n\nI’ll either take bits of songs with me or - like this weekend - we went into the studio and we were like we need two more songs and we’ll sit on Spotify for half an hour and talk about what kind of stuff we like and we’ll pull inspiration. We say “I wanna write a song like that”, so okay, “what kind of drums is that?” And then quite often you’ll sit for half an hour and think ‘what are all the things that I’m thinking about at the moment?’ You’ll go from there. \n\nIf I’m writing on my own I can’t quite do that. Sometimes you’ll be doing something and it just hits you, it sounds so naft to be like “I have to just go grab a guitar!” but sometimes you just need to. I write words all the time. I don’t have that much structure. It’s completely unproductive but it works for me, haha. \n\nI think you learn writing styles from other people as well. I never used to write with a laptop I never used to write with a beat I would just write with a guitar or piano but now, I still have my guitar, but playing with production you put together some chords and you layer stuff and just loop it and riff over it- I never used to write like that ever but I’ve learnt that from working with other people. You pick up from those other influences. It’s really important to write with as many people as you can. \n\n**Moving forward, what's coming up in the short term and long term for you?**\n\nIn the short term, the single is out and then it’s part of an EP which will be out in a couple months, there’s about four songs on there. And then I’m still writing now so hopefully there will be another one after that. The aim of the year is just to write as much as I can. \n\nGigging wise, I have a couple gigs coming up as well. The Sneaky Pete’s one was great, it was so fun, and I want to do more. \n\nLong term I just want to do this. I want to be a pop star. I just do. Working towards that, writing as much music as I can, and trying to get someone to like discover me. I think there’s a lot of great music coming out, I’m really excited. \n\n**What is your favorite part of being a musician?**\n\nThe gig was one of the best moments. I’d been so nervous about gigging, ‘cause I started writing properly in the lockdown and that seemed like you would never be able to gig again. I just got more and more nervous and everyone was like “that's the best bit!” and I thought ‘err no I’ll just put music out and I don’t have to do it’. But it was just the best. I didn’t think I could perform at all. Something happened and now I find it so freeing. Even the open mics and stuff it’s all just so fun. That is definitely a highlight. \n\nThe work in Manchester has also been really cool. The guys I work with actually want to write with me and believe in it. I had one writing session with them in summer. They’re called Soap. I wrote with them for a day and I thought it was really fun but I didn’t know if they would want me back but they were like “no we want to do a whole EP” and I was like ‘woah okay’. That’s really cool when people really believe in you and want you to do more. \n\nSome people don’t write about things that are therapeutic, and I don’t see it as therapy, but it is helpful to, you know, feel really stressed and be able to sit down and articulate it, to turn it into something. To make stuff for people to listen to and relate to I think that’s really cool. \n\nThat I could write something and someone could go, ‘oh I felt that’. To bring people together in that way. To imagine people I don’t know shouting the words back at me at a gig, people in a crowd singing to me, that’s just amazing. \n\n**Phoebe Hall (she/they) is a current musician and undergrad at the University of Edinburgh. Her single ‘Runaway’ and other songs are available on Spotify and Apple Music. Keep an eye out on her Instagram @phoeb_emusic for upcoming gigs and performances.**"},{"id":1644796800,"title":"Sensual Illustrations by Zoe Hooper","author":"Zoe Hooper ","date":"February 14, 2022","coverurl":"./assets/images/zoe-hopper.png","content":"My name is Zoe and I am currently a dance student here in Edinburgh. During the height of the pandemic last year, I moved home to Malaysia to be with family and this brought about a massive change to my routine, independent freedoms and way of living. \n \nPole dancing and exploring sensuality has increasingly become a passion of mine, but under a strict Chinese household in Malaysia, this felt really restricted. I noticed that I hid away my authentic self in front of the watchful eye of my family, and that ultimately affected my confidence. During the lockdown, I felt so isolated, like so many of us did, without the ability to socialise or do what I love; dance in a studio. However, during this time and almost completely by accident, I found a new hobby and a new community online that brought me so much joy, and still does to this day. \n \nI started drawing pole dancers as a way to still connect to the aerial and pole community while I was stuck at home. I really enjoyed capturing these poses with minimalistic line art, but I started to add floral elements to inject some of my taste and personality into the pieces. As a dancer, I really love movement...and soon enough I started to try my hand at animation. I have had the most amazing time combining my interest in body inclusivity and movement with art, and through it I regained happiness and confidence within myself, using my Instagram account as my creative outlet.\n \nWith my art I try to create a welcoming and warm space. I love interacting with so many like-minded creatives. I have had the amazing opportunity to connect with some of my favourite artists and brands such as SoyandSpice Lingerie (Australia) and OurBraletteClub (Singapore) and JyGao (Canada). One of the highlights of my year was collaborating with my friend, and pole dancer, Callum Stevens to fundraise for a non-profit organization in Malaysia called SEED who were working hard to support Trans people affected by the pandemic in Malaysia by providing food and groceries, shelter and access to emergency and medical services. We ended up raising RM3186 (approximately £556) for their Trans Solidarity Fund, which completely exceeded our hopes and expectations.  \n \nI have been incredibly lucky in my art journey and I am surrounded by inspiration and amazing friends. I started from making drawings of my friends, to animation, and now I have even started a venture with a partner to make ornaments and acrylic lights. I never would have imagined that this account would bring me such opportunities, and I am forever grateful. Throughout the changes in my life, something that has remained constant is my desire to stay true to myself and express that creatively in any capacity I can. \n \nZoe Hooper\n@x_she.doodles_x\n"},{"id":1642636800,"title":"Message From World","author":"Moira Semel","date":"January 20, 2022","coverurl":"./assets/images/rachel-interview.png","content":"Rachel Gladwin interviewed by Moira Semel\n\n**How would you describe _Message from World_?**\n\n_Message from World_ is an instagram account with pictures of street signs, graffiti, advertisements, just anything where it’s a piece of text I’m seeing out in the world that I didn’t expect to see, that I don’t know who wrote it. I take a picture of it and I put it on the instagram. \n\n**How did this instagram account start?**\n\nIt started when I was interrailing. I had been taking a lot of photos of texts when I was traveling because I’m very drawn to when there's a weird sticker or just like someone's written something funny. There was this huge billboard outside the airport when I was going home, I was flying by myself for the first time so I was anxious and it just said _comfort_ on it. And I thought _that’s fun_ ‘cause it’s like a message from the universe being like chill out. I just impulsively decided to start the account because it was the kind of thing that you don’t actually want to fill up your instagram feed with just pictures of words so it's just a fun little thing where I just put them up there.\n\n**What do you imagine other people get out of looking at _Message from World?_**\n\nI think it satisfies the same curiosity of when you’re out on the street and you see something weird that someone has written. It's fun. And it’s funny when you’re walking down the street and someone points out a sign that is _like that’s weird_. It’s more interesting sometimes than looking at an image to read some words. It’s stimulating and it’s interesting. And then also some of my friends who follow the account will send them to me when they see one and it becomes like a collaborative thing. So I wonder if it makes people notice more. I think anything where you’re just noticing more things makes life a bit more interesting. To read those words and give value to them by taking a photo. \n\n**So, how do you think noticing small messages from the universe changes your daily life?**\n\nIt means that I’m always reading things and I’m always thinking, _is that an interesting message?_ I pay more attention to graffiti and advertisements and stuff. I actually really enjoy the less organic ones where it’s just a weird advert with a weird slogan and I’m like _if you take that out of context of the advert it’s a weird sentence_ and I think that’s quite fun. \n\n**When you take pictures are you thinking of how the followers might view it or are you thinking about your own interpretation?**\n\nI’m kind of thinking about both. I don’t love taking pictures of something that’s very obvious, like if it’s already an interesting piece of artwork with something written out with the intention of being a beautiful message– I do have some like that on there–  but I’m less interested in that. I think it’s more interesting when I’m recontextualizing something that’s just a bit random and no one intended it to be that meaningful. So I don’t know if anyone who follows me cares but I don’t want to go too cheesy. \n\n**Do you see the messages as from the universe or are the viewers the ones who make it a message?**\n\nI like buying into the idea of that. That’s like the bit of the account, pretending that I’m seeing these messages because the universe is sending them to me but they’re obviously just random things and I am constructing meaning from them and whoever is looking at the account is constructing meaning from them. It’s having a good sense of what things could mean, having good humour about it, is what gives it meaning. I don’t actually think the universe is talking to me, it's just a fun game. \n\n**What is your favorite message on the account?**\n\nI like this one where it's a street sign and it says _take extra care_. It’s saying don’t fall into the canal but out of context it’s kind of beautiful. \n\n_See the light, repairs_. That’s another good one. Like _See the light!_. Yeah, haha. Those are some favorites where it’s very obviously not a meaningful thing but taken out of context.\n\n**If you had one thing to say to the reader about _Message from World_, what would you tell them?**\n\nI would tell them to follow it and to start taking photos of any phrases they think are interesting and send them to me. ‘Cause it’s a fun game. Like just walk around and pretend that everything you read could be so interesting. Like adverts, so boring and horrible and pushed on us, but it’s fun to take them out of context. Take some photos and send them to me. :)\n\n**Rachel Gladwin (she/her) is the admin of the instagram account @messagefromworld and a student at the University of Edinburgh.  ** "},{"id":1642550400,"title":"The University Experience","author":"Tanishtha Goswami","date":"January 19, 2022","coverurl":"./assets/images/uni-exp.png","content":"TW: Sexual Assault\n\nWhat defines the university experience? For me the university experience is rushing through campus to get to my class that started ten minutes ago while shamefully holding a fresh coffee and thereby getting possibly the worst seat for the next two hours of my life. I think the concept of “the university experience” probably differs person to person, I’m sure to some, it's the parties or clubbing or sports games or other tropes that you see in every coming-of-age movie ever.  It would have never once crossed my mind that these “experiences” that are so intertwined with the idea of university or college could ever be something so brutally honest and to be frank, sad. \n \nI don’t remember exactly where I was when I saw the sign for the first time, but I do remember that I was walking through Potterrow when it caught my eye. I couldn’t have lingered on it for more than a second, but the words haunted my mind the entire day. \n \n                        “Sexual assault should NOT be a part of your college experience” \n \nIt wasn’t until then that I realized how much I normalised sexual assault in this day and age - especially within university culture. I thought back to the countless discussions I had with my friends where we shared our collective “creepy” experiences in clubs, parties, or even just walking home in broad daylight. How I brushed it off and continued with my life because it was simply just another part of us. How when the use of spiking in clubs suddenly became another mental note to ‘carry a jacket’ and ‘be extra cautious’ when trying to have a fun time with your friends. I wasn’t sure when I decided to be so apathetic - though it wasn’t a conscious choice on my part. \n \nIt made me realize how much I was contributing to this normalisation culture. How every time I heard another story or an encounter, I simply brushed it off as if it was a daily occurrence. How I suddenly stopped caring about protests and petitions because so often I felt that nothing ever changed. How I repeatedly told myself that any type of uncomfortableness was simply ‘part of being a woman’. \n \nIt made me disgusted with myself, but I still couldn’t shake my feeling of indifference. It was reassuring to know that even though I was being passive that there were still people out there who cared now more than ever. It was a wakeup call of sorts. It’s so easy to reach this point where you suddenly detach from how terrible everything really is. Take the pandemic as an example, I remember how alert and cautious everyone was when the first wave took place. Now? Many people can’t find the energy within them to still be as concerned or responsive about it. \n \nSometimes a wake-up call is exactly what you need. Even though there is nothing I want to do more right now than pretend that sexual assault isn’t a problem that plagues our society, I know I can’t. I can’t pretend to write about something else to not face reality.  I hope this can serve as a wake-up call for you too. I also hope that it is equally reassuring that it is okay to feel disheartened when fighting against these issues, but that when you do choose to come back you will be welcomed with open arms. \n\n**Tanishtha Goswami (she/her)**"}]