[{"id":1650409200,"title":"The Beautiful Body that is Mine","author":"Payton Covelli ","date":"April 20, 2022","coverurl":"./assets/images/TheBeautifulBodythatisMine.png","content":"\n\nWhen will the time run thin in the hourglass\n\nor the pear turn to rot\n\nwhen the music turns sour in a once tuned, sweet violin?\n\nBut then again\n\nwhy label my body as an object?\n\nMy body does not look like an hourglass, it does not look like a pear,\nan apple, a violin\n\nit looks like a body\n\nand I look like a woman.\n\nEternal in beauty\n\nEven when I am a mortal creature with finite time\n\nto make music, to sip sweet summer wine, to devour the fruits of life.\n\nShould I not spend my time in this body basking in the beauty of a world\nthat reflects my womanhood.\n\nMy physique will not mark an expiration of a life well lived.\n\nFor my body makes its own sweet music,\n\nsinging tis own song\n\nIt walks through the blissful dawns and dark nights marking the ebb and\nflow of time\n\nIt swims, it runs\n\nIt is a body\n\nnot a statue.\n\nIt eats what it craves and is not ashamed of how it moves or what it\nwears\n\nIt is not ashamed when it bends and breaks\n\nbut with each blemish it rebuilds itself\n\nLike gold glazing the cracks of a porcelain plate\n\nThe lines in my legs are visible\n\nThe freckles of my face shine\n\nBurns and bruises and scrapes,\n\nmemories of a life well lived.\n\nThey hold me\n\nground me\n\nbut do not define me.\n\nInstead, I find my place in the stars\n\nDisembodied glorious as I fade into the cosmic unknown\n\nAfterall, my body is tied to the ground, but my mind is not\n\nAnd while mother nature is eternal and will continue to hold this earth\n\nI am a finite woman who will one day rule the sky\n\nwhen she takes my body and turns it into the bendy trees, the flowing\nrivers,\n\nthe boulders that ground the world,\n\nand the flowers that blow in the breeze.\n\nI am many shapes and many minds\n\nBut I am all woman and my body\n\nIs just a body.\n\nI do not have enough time on this earth to be defined by a shape.\n\n**Payton Covelli (she/her)**"},{"id":1650322800,"title":"The Priory of the Orange Tree | Book Review","author":"Zoe Hooper ","date":"April 19, 2022","coverurl":"./assets/images/BookReviewThePrioryOfTheOrangeTree.png","content":"*The Priory of the Orange Tree* - 800 pages wasn't enough!\n\nThe *Priory of the Orange Tree* is a gorgeously-written feminist novel.\nSet in a fantastical world around 500 years ago, it follows the\nintertwining stories of several main characters as they chase goals,\ndragons, and to protect those they love. Each of their journeys begin in\ndistant parts of the world and throughout the course of the book slowly\ncome together, the lines of their respective fates becoming irrevocably\nentangled. In the East, Tane dreams of being a dragon rider, revered by\nall and a warrior-companion to the gods of flight. Turning Westwards,\nEad navigates the delicacies of Inysh court, fulfilling surface-level\nduties while covertly foiling assassination attempts on Queen Sabran. On\na small trading island, Doctor Niclay's Roos simultaneously seeks an end\nto his exile and the elixir of life. None end the tale where they began.\nThese are but three out of a host of intricate characters whose lives\n*The Priory of the Orange Tree* ufolds. Each stands firmly in their own\nbeliefs, but as their pursuits take them to unexpected places and a\ncommon enemy emerges, they must reconsider their centuries-old\ndifferences. Religion, sexuality, familial ties, and culture are all\nthemes Samantha Shannon, our brilliant author, explores throughout the\nnovel's 800 pages. Rest assured there is not a dull moment to be found\non any of them; Shannon manages to weave a complex tale with such bright\nthreads that you'll never lose your way. 800 pages truly isn't enough to\nsate the hunger for adventure and thoughtful communication that *The\nPriory of the Orange Tree* will spark inside you.\n\nAbsolutely five stars ★★★★★\n\n\"'You know the story,' Chassar said. 'You know how a knight rescued a\nfair lady from a dragon and took her away to a kingdom across the sea.\nYou know that they founded a great city and lived happily ever after.'\nHe smiled. 'Everything you know is false.'\"\n\n\"There is courage, I think, in open-mindedness and thinking for\noneself.\"\n\n\"Remember, Tane, that a sword does not need to be whetted all hour to\nkeep it sharp.\"\n\n**Indigo Williams (she/her)**\n"},{"id":1648339200,"title":"Shifting the Body Positivity Movement","author":"Indigo Williams ","date":"March 27, 2022","coverurl":"./assets/images/bodyPositivity.png","content":"Throughout recorded human history, the standards for women's beauty have ebbed and flowed, influenced by changing times and the growth of globalization. During the renaissance period, women were preferred to have generous curves because they symbolized wealth and were in line with the artistic style of the time. In the 1920s it was popular to have a flat chest because clothes of the day were designed to fit smaller breasts. In today's world, the 'ideal' body looks something like a Barbie. All have necessitated smooth skin and luscious hair (but only on our heads).\n\nIt's frustrating enough that women have never been seen as more than objects to have sex with and bear babies, but to then have that worth reduced further yet by demanding we modify our bodies to meet certain unatainable guidelines? It's one of history's longest running insults. The modern age of social media has exponentially exacerbated the issue by upping the stakes and eliminating any corner of life in which women might have been able to feel comfortable.\n\nThen, flying in wearing a pink cape, comes the body positivity movement.\n\nThe movement began around 2012, and since then the internet has begun to fill with messages and posts encouraging women to embrace their curves, stretch marks, and rolls. Through the collective power of feminists the world over, these taboo aspects of the female form have been brought into the light for all to celebrate. Plus sized people, formerly shamed in advertisements, on TV and in magazines have found positive representation in such media. Brands like Nike and Target now have plus size mannequins in their stores and major runways have seen more and more full-bodied women walking down them. Scientists are increasingly collecting the data and showing the world that yes, [you absolutely can be healthy at any size](https://www.goodhousekeeping.com/health/diet-nutrition/a35058950/can-a-person-be-fat-and-fit/), and people like [Lizzo](https://www.rollingstone.com/music/music-features/lizzo-cover-story-interview-truth-hurts-grammys-937009/) (musical artist and overall icon) are exemplifying that science. This all undoubtedly amounts to a wonderful step forward. Is it the most powerful step we could have taken though? And did the feminist community truly take it together?\n\nIt's been ten years since the beginning of the movement and it seems time to reevaluate. We have, in overwhelming majority, used the term 'body positivity' in reference to the inclusion and elevation of women who are plus sized. By doing so, we have created a term that appears to be widely inclusive but in reality has only changed the guidelines by a fraction. The media and social platforms now say that yes, plus size is okay, but only if it comes in an hourglass figure, with boobs that are still perky, and if there aren't any lumps or bumps in the line of your dress. Plus size people are accepted only if they exclusively eat 'healthy' foods, wear trendy clothing, and have flawless makeup. All this, and we're still just focusing on weight.\n\nIf the focus of the movement were solely on that, it would have been called something more akin to &quot;The Plus Size Positivity Movement.&quot; However, the title we chose and need to honor is _Body_ Positivity. As in every part of every body. We need to celebrate height differences, adult acne, colostomy bags, hair loss, small eyes, big ears, and breasts that point in opposite directions or reach down to say hi to our belly buttons. We need to uplift those whose bodies are in any kind of recovery, transition, or struggle; those born with features society negatively deems &quot;deformities,&quot; people who cover themselves with tattoos and others that wear little at all to show off their gorgeous skin. These are a lot of traits to wrap our minds around all at once, a lot to even remember. It's difficult to change the pathways our thoughts have followed our whole lives; the pathways that teach us to look at everyone, including ourselves, with a critical eye. Our brains make these snap-judgements about others and the first judgement that comes to mind is generally what we've been conditioned by society and the media to think.\n\nFor me, my brain is in the habit of judging others because I, as many of us do, judge myself so harshly. For example, when I'm walking down the street and I see someone with a trait outside of what the media deems acceptable, my brain sometimes jumps to being negative about that trait and subsequently that person. What I try to do is to take a mental step back and reexamine if I really believe that thought or if it's just something I've heard or read so much it's become ingrained. Oftentimes it is just that, and when it isn't I'll pause and remind myself that _all_ bodies are equally worthy of love and respect. While I may not choose to grow my armpit hair out and braid it, the woman standing next to me at the crosswalk does and particularly because I don't know her at all, it's easy to hope that their hair brings them some extra joy and confidence. So, if I allow myself to be joyful for her I'm on some level celebrating her armpit hair and subsequently armpit hair in general. Thus, my view of beauty is expanded, and if I look even further I realize that I'm judging myself less harshly as well.\n\nIt's easy to admire the traits that Instagram and similar platforms insist are the select few that translate into beauty, and it's hard to question that messaging when it surrounds us. Like with any habit, building up our own positive messaging necessitates consistency and some self-examination. This is what the movement can and should be about; actively honoring and respecting each other's bodies, no matter what they look like. We can't continue living in between these guidelines, accepting one part of how someone looks but not another, saying that rolls are now okay on your stomach but not under your chin; accepting it when our brain tells us that an individual walking down the street with a big butt is beautiful but the person on the other side with big arms isn't.\n\nWhether we like it or not, our physical appearances are a huge part of individual and group identity. They represent us wherever we go and while they're certainly not the most important part of our beings, how we view others bodies and our own is a major part of life. It affects our emotions, interactions, and patterns of thought. We're in it, so we might as well be in it together. In the end _we_ are the driving forces of media, _we_ are the positivity, _we_ are the movement. And we can make it as wildly fucking inclusive as we want.\n\n**Indigo Williams (she/her) is a New York born author who is so excited to have joined the team at Se7en as a staff writer. She specializes in Op-Eds and poetry, but writes bilingual feminist smut on the side. Her hobbies include playing guitar, drinking coffee and chasing any of Edinburgh's blue skies.**"},{"id":1646438400,"title":"Up and Coming Musician Phoebe Hall","author":"Moira Semel","date":"March 5, 2022","coverurl":"./assets/images/Phoebes-INterview-min.jpg","content":"Phoebe Hall interviewed by Moira Semel\n\n**How long have you been making music and what got you into releasing music more professionally?**\n\nI’ve been writing since I was about 17. I’d always sung at school but then I started writing when I got more anxious, when I started 6th form. I actually wrote my first song after a panic attack. Which, I think, is quite a good way to deal with it. I’d always wanted to start writing properly and I’d always written little verses but then I actually wrote a full song and I started to really do it  in my year out before I came to uni. The new stuff I’ve been writing, I’ve been working in Manchester for the past few months. I started to release properly this year, really. It’s the big year. \n\n**Your new song ‘Runaway’ is about to come out. How do you feel about it coming out? How does it feel to release a song?**\n\nIt’s a weird one. We had put it out on Soundcloud because I wanted people to know it for the first gig. I thought that would be fun for my friends and family who were there to know the words. With Soundcloud it's a real effort for people to get to it, so it kind of feels like I've been sitting on it for such a long time. It’s like you build up to it for so long that tomorrow is going to be a bit strange. It’s a process you have to start really early. It takes quite a while for all the platforms to get the song. Sort of a weird process. It takes like a month to do it all. So it is quite a lot like building up. I don't want to say underwhelming cause I think that’s the wrong word. It is really exciting and it’s always great when you get messages and you’ve sometimes reached people that you didn’t think you would reach. \n\nThere is always an element of, because I’m not like Adele you know, it’s not going to blow my mind, but it’s always nice to have it out because I am really happy with it. It is a new era of music for me and it's a sign of all the things that are coming. In general, I'm excited is my answer.\n\n**Do you feel your identity is formed by your music or your music by your identity?**\n\nInitially the music was formed by my identity. But I think particularly with the stuff I’ve been writing now in Manchester, I didn’t know the guys I was writing with and you have to just sit down and talk about musical influences and your life and they know more about me than people in my life do now it's like, \n**- an interesting therapy session? -** \nit is! It's weird cause like I'd write a line and they’d be like what do you mean by that and it’s just like oop umm. It all becomes a weird like, like it’s a weird industry where you sit down with people you barely know and tell them everything. So I’d say working with them definitely shapes my music. \n\nI like to be driven by my relationships and I also write a lot about queerness and my identiy and how I dress and androgyny. Those things shape the music and the sound. But I think the music and your identity, they eventually shape each other. You create an image when you’re making music. I’ve got this bedroom pop image and that kind of thing. That’s the music I make and you kind of have to lean into it ‘cause those are the kind of things you write about. \n\n**So this image that you’re making of bedroom pop. We all have these social media platforms where we are judged off of these digital versions of ourselves that are both you and not you. As a musician how do you feel about having to create and uphold social media constructions of yourself?**\n\nIt’s definitely a bit of a mind field. I think with TikTok especially, with releasing stuff now so much of it is pushed by putting TikToks out all the time. You make five TikToks that look the same but you have to put them out to try. It’s really good in some ways because it means that everyone has a platform who might not otherwise have had one but it’s also bad because labels aren’t going to gigs anymore they’re just looking at TikTok and seeing a kid who can sign and signing them. It’s such a strange process. It’s really changed the industry. People are now literally curating songs for TikTok. Which is just so bizarre. \n\n**Do you feel a pressure to do that?**\n\nYeah, I feel like it can be really fun if I make stuff that’s fun and it is really exciting to reach people that you might not have reached normally. It can be global if things go really well. All the work that I’ve done in Manchester is because this guy just reached out from seeing a post and I wouldn’t have gotten that opportunity if I hadn’t done that.  \n\nBut trends go so fast. ‘This week people are talking about the sound’ and ‘this week they’re talking about the lyrics’. Or ‘that was on trend three weeks ago, don’t do that’. It’s about making myself more on top of it. \nI was reading about scrapbook Instagram where people are treating personal accounts like a scrapbook. So it looks like it’s less curated but it’s not. Like really blurry, shit pictures are actually more curated. There is a certain pressure to keep the socials looking good. It is really fun but I’m just learning about it all the time. Keeping your account really cool and having a balance of still having a personal account but also building a professional one. \nIn the new year I wanted to delete TikTok and delete Instagram but I literally can’t. I know it’s like “boohoo get out of my tiny world” but it’s just an interesting situation to be in. \n\n**What does it look like for you to write music and where do you get your inspiration?**\n\nSo if I’m writing on my own it’s usually with a guitar. Start with some chords and go from there. The guy who I gig with, he’s my best mate in uni, I’ll send him something and he’ll play around with it. We write stuff like that quite a lot. Then I’ll usually take that with me for the sessions in Manchester and I’ll do my main writing there. \n\nI’ll either take bits of songs with me or - like this weekend - we went into the studio and we were like we need two more songs and we’ll sit on Spotify for half an hour and talk about what kind of stuff we like and we’ll pull inspiration. We say “I wanna write a song like that”, so okay, “what kind of drums is that?” And then quite often you’ll sit for half an hour and think ‘what are all the things that I’m thinking about at the moment?’ You’ll go from there. \n\nIf I’m writing on my own I can’t quite do that. Sometimes you’ll be doing something and it just hits you, it sounds so naft to be like “I have to just go grab a guitar!” but sometimes you just need to. I write words all the time. I don’t have that much structure. It’s completely unproductive but it works for me, haha. \n\nI think you learn writing styles from other people as well. I never used to write with a laptop I never used to write with a beat I would just write with a guitar or piano but now, I still have my guitar, but playing with production you put together some chords and you layer stuff and just loop it and riff over it- I never used to write like that ever but I’ve learnt that from working with other people. You pick up from those other influences. It’s really important to write with as many people as you can. \n\n**Moving forward, what's coming up in the short term and long term for you?**\n\nIn the short term, the single is out and then it’s part of an EP which will be out in a couple months, there’s about four songs on there. And then I’m still writing now so hopefully there will be another one after that. The aim of the year is just to write as much as I can. \n\nGigging wise, I have a couple gigs coming up as well. The Sneaky Pete’s one was great, it was so fun, and I want to do more. \n\nLong term I just want to do this. I want to be a pop star. I just do. Working towards that, writing as much music as I can, and trying to get someone to like discover me. I think there’s a lot of great music coming out, I’m really excited. \n\n**What is your favorite part of being a musician?**\n\nThe gig was one of the best moments. I’d been so nervous about gigging, ‘cause I started writing properly in the lockdown and that seemed like you would never be able to gig again. I just got more and more nervous and everyone was like “that's the best bit!” and I thought ‘err no I’ll just put music out and I don’t have to do it’. But it was just the best. I didn’t think I could perform at all. Something happened and now I find it so freeing. Even the open mics and stuff it’s all just so fun. That is definitely a highlight. \n\nThe work in Manchester has also been really cool. The guys I work with actually want to write with me and believe in it. I had one writing session with them in summer. They’re called Soap. I wrote with them for a day and I thought it was really fun but I didn’t know if they would want me back but they were like “no we want to do a whole EP” and I was like ‘woah okay’. That’s really cool when people really believe in you and want you to do more. \n\nSome people don’t write about things that are therapeutic, and I don’t see it as therapy, but it is helpful to, you know, feel really stressed and be able to sit down and articulate it, to turn it into something. To make stuff for people to listen to and relate to I think that’s really cool. \n\nThat I could write something and someone could go, ‘oh I felt that’. To bring people together in that way. To imagine people I don’t know shouting the words back at me at a gig, people in a crowd singing to me, that’s just amazing. \n\n**Phoebe Hall (she/they) is a current musician and undergrad at the University of Edinburgh. Her single ‘Runaway’ and other songs are available on Spotify and Apple Music. Keep an eye out on her Instagram @phoeb_emusic for upcoming gigs and performances.**"},{"id":1644796800,"title":"Sensual Illustrations by Zoe Hooper","author":"Zoe Hooper ","date":"February 14, 2022","coverurl":"./assets/images/zoe-hopper.png","content":"My name is Zoe and I am currently a dance student here in Edinburgh. During the height of the pandemic last year, I moved home to Malaysia to be with family and this brought about a massive change to my routine, independent freedoms and way of living. \n \nPole dancing and exploring sensuality has increasingly become a passion of mine, but under a strict Chinese household in Malaysia, this felt really restricted. I noticed that I hid away my authentic self in front of the watchful eye of my family, and that ultimately affected my confidence. During the lockdown, I felt so isolated, like so many of us did, without the ability to socialise or do what I love; dance in a studio. However, during this time and almost completely by accident, I found a new hobby and a new community online that brought me so much joy, and still does to this day. \n \nI started drawing pole dancers as a way to still connect to the aerial and pole community while I was stuck at home. I really enjoyed capturing these poses with minimalistic line art, but I started to add floral elements to inject some of my taste and personality into the pieces. As a dancer, I really love movement...and soon enough I started to try my hand at animation. I have had the most amazing time combining my interest in body inclusivity and movement with art, and through it I regained happiness and confidence within myself, using my Instagram account as my creative outlet.\n \nWith my art I try to create a welcoming and warm space. I love interacting with so many like-minded creatives. I have had the amazing opportunity to connect with some of my favourite artists and brands such as SoyandSpice Lingerie (Australia) and OurBraletteClub (Singapore) and JyGao (Canada). One of the highlights of my year was collaborating with my friend, and pole dancer, Callum Stevens to fundraise for a non-profit organization in Malaysia called SEED who were working hard to support Trans people affected by the pandemic in Malaysia by providing food and groceries, shelter and access to emergency and medical services. We ended up raising RM3186 (approximately £556) for their Trans Solidarity Fund, which completely exceeded our hopes and expectations.  \n \nI have been incredibly lucky in my art journey and I am surrounded by inspiration and amazing friends. I started from making drawings of my friends, to animation, and now I have even started a venture with a partner to make ornaments and acrylic lights. I never would have imagined that this account would bring me such opportunities, and I am forever grateful. Throughout the changes in my life, something that has remained constant is my desire to stay true to myself and express that creatively in any capacity I can. \n \nZoe Hooper\n@x_she.doodles_x\n"},{"id":1642636800,"title":"Message From World","author":"Moira Semel","date":"January 20, 2022","coverurl":"./assets/images/rachel-interview.png","content":"Rachel Gladwin interviewed by Moira Semel\n\n**How would you describe _Message from World_?**\n\n_Message from World_ is an instagram account with pictures of street signs, graffiti, advertisements, just anything where it’s a piece of text I’m seeing out in the world that I didn’t expect to see, that I don’t know who wrote it. I take a picture of it and I put it on the instagram. \n\n**How did this instagram account start?**\n\nIt started when I was interrailing. I had been taking a lot of photos of texts when I was traveling because I’m very drawn to when there's a weird sticker or just like someone's written something funny. There was this huge billboard outside the airport when I was going home, I was flying by myself for the first time so I was anxious and it just said _comfort_ on it. And I thought _that’s fun_ ‘cause it’s like a message from the universe being like chill out. I just impulsively decided to start the account because it was the kind of thing that you don’t actually want to fill up your instagram feed with just pictures of words so it's just a fun little thing where I just put them up there.\n\n**What do you imagine other people get out of looking at _Message from World?_**\n\nI think it satisfies the same curiosity of when you’re out on the street and you see something weird that someone has written. It's fun. And it’s funny when you’re walking down the street and someone points out a sign that is _like that’s weird_. It’s more interesting sometimes than looking at an image to read some words. It’s stimulating and it’s interesting. And then also some of my friends who follow the account will send them to me when they see one and it becomes like a collaborative thing. So I wonder if it makes people notice more. I think anything where you’re just noticing more things makes life a bit more interesting. To read those words and give value to them by taking a photo. \n\n**So, how do you think noticing small messages from the universe changes your daily life?**\n\nIt means that I’m always reading things and I’m always thinking, _is that an interesting message?_ I pay more attention to graffiti and advertisements and stuff. I actually really enjoy the less organic ones where it’s just a weird advert with a weird slogan and I’m like _if you take that out of context of the advert it’s a weird sentence_ and I think that’s quite fun. \n\n**When you take pictures are you thinking of how the followers might view it or are you thinking about your own interpretation?**\n\nI’m kind of thinking about both. I don’t love taking pictures of something that’s very obvious, like if it’s already an interesting piece of artwork with something written out with the intention of being a beautiful message– I do have some like that on there–  but I’m less interested in that. I think it’s more interesting when I’m recontextualizing something that’s just a bit random and no one intended it to be that meaningful. So I don’t know if anyone who follows me cares but I don’t want to go too cheesy. \n\n**Do you see the messages as from the universe or are the viewers the ones who make it a message?**\n\nI like buying into the idea of that. That’s like the bit of the account, pretending that I’m seeing these messages because the universe is sending them to me but they’re obviously just random things and I am constructing meaning from them and whoever is looking at the account is constructing meaning from them. It’s having a good sense of what things could mean, having good humour about it, is what gives it meaning. I don’t actually think the universe is talking to me, it's just a fun game. \n\n**What is your favorite message on the account?**\n\nI like this one where it's a street sign and it says _take extra care_. It’s saying don’t fall into the canal but out of context it’s kind of beautiful. \n\n_See the light, repairs_. That’s another good one. Like _See the light!_. Yeah, haha. Those are some favorites where it’s very obviously not a meaningful thing but taken out of context.\n\n**If you had one thing to say to the reader about _Message from World_, what would you tell them?**\n\nI would tell them to follow it and to start taking photos of any phrases they think are interesting and send them to me. ‘Cause it’s a fun game. Like just walk around and pretend that everything you read could be so interesting. Like adverts, so boring and horrible and pushed on us, but it’s fun to take them out of context. Take some photos and send them to me. :)\n\n**Rachel Gladwin (she/her) is the admin of the instagram account @messagefromworld and a student at the University of Edinburgh.  ** "}]