[{"id":1637193600,"title":"Obstacle Avoidance Robot with IR Sensor","author":"Auro","date":"November 18, 2021","content":"In this project, a KY-032 IR avoidance sensor is used to guide a robot car to prevent collisions with obstacles. The car is driven using two front wheels, controlled independently and bidirectionally using L293DNE motor driver chip. An uncontrolled third wheel was used to balance the chassis on the rear. The direction of movement is controlled by using a tank steering system with the front wheels.The response time for the car to an obstacle is found to be about 0.17s. The distance it travels during the response time is about 19(1) mm. The range of obstacle detection is also found to vary depending on the nature of surface of the obstacle. \n\n\n[Read full report here](https://uoe-my.sharepoint.com/:b:/g/personal/s1905547_ed_ac_uk/EVHGqw-Yo7dClN3-NZwrVPUBh2IGyUrMV2P3Jy5hhrnTrw?e=Dkp3VE)"},{"id":1627772400,"title":"Reliably sizing particles in Multi-modal Suspension","author":"Auro","date":"August 01, 2021","content":"<b>Numerous conventional techniques are available to calculate particle size distributions in colloidal suspensions. However, to achieve any reliable statistics, the methods are limited to mono-modal suspensions. A new technique, Differential Dynamic Microscopy(DDM) is explored in search for a reliable method to study multimodal suspension. The experiment considers Bi-modal polystyrene suspension under Laser Diffraction, Scanning Electron microscopy and DDM. The obtained data are compared to understand the limitations of each method.</b>  \n<br>\n\nThe experiment aimed at finding the size distribution of Polystyrene suspension in waterusing three different techniques, namely - Scanning Electron Microscopy, Laser Diffrac-tion Particle analyzer and Direct Differential microscopy.   Then comparing the resultsobtained to judge the reliability of the methods for bi-modal suspensions of known con-centration by weight.\n\n[Read full report here](https://uoe-my.sharepoint.com/:b:/g/personal/s1905547_ed_ac_uk/EcMJeXtDfCRCquqHvlJwWL4BHdUDad8hbpqqhoPjAyC4YA?e=FSGWFe)"}]